-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 30, 2025 at 06:33 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `news_site_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `title`) VALUES
(3, 'جامعه'),
(4, 'متفرقه'),
(13, 'سیاست'),
(14, 'ورزشی'),
(15, 'اقتصاد');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `comment` varchar(255) NOT NULL,
  `post_id` int(11) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `comments`
--

INSERT INTO `comments` (`id`, `name`, `comment`, `post_id`, `status`) VALUES
(24, 'سارا', 'پینگ پنگ بازان ایران در کانتندر جوانان دوحه به مدال نرسیدند', 22, 0);

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `body` text NOT NULL,
  `category_id` int(11) NOT NULL,
  `author` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `body`, `category_id`, `author`, `image`) VALUES
(22, 'عراقچی: به جای فلسطینی‌ها، اسرائیلی‌ها اخراج و به گرینلند فرستاده شوند', 'ترامپ در سال ۲۰۱۸ از توافق هسته‌ای ایران با قدرت‌های جهانی، از جمله آمریکا، به بهانه ناقص بودن آن خارج شد و با در پیش گرفتن سیاست «کارزار فشار حداکثری» تحریم‌های پیشین علیه ایران را که طی این توافق لغو شده بودند، بازگردانی کرده و تحریم‌های جدیدی را نیز علیه ایران اعمال کرد.\r\n\r\nعراقچی در گفت‌وگویی اختصاصی با شبکه انگلیسی اسکای نیوز درباره تهدیدات علیه تأسیسات هسته‌ای ایران تاکید کرد: صراحتاً گفته‌ایم هرگونه حمله به تأسیسات اتمی ما با پاسخی فوری و قاطع روبرو خواهد شد. اما فکر نمی‌کنم چنین کار دیوانه‌واری کنند. این کل منطقه را به فاجعه‌ای بسیار بد تبدیل می‌کند.\r\n\r\nاو در این گفت‌وگو در واکنش به ابراز تمایل ترامپ به توافق با ایران گفت که به‌رغم آمادگی او برای شنیدن صحبت‌های رئیس‌جمهور آمریکا، ترغیب کردن ایران به آغاز مذاکراتی تازه با آمریکا برای توافقی دیگر، با توجه به آنچه برای توافق سال ۲۰۱۵ رخ داد، نیازمند اقدامات بیشتری است.\r\n\r\nوزیر امور خارجه ایران بیان کرد: وضعیت کنونی متفاوت و بسیار دشوارتر از قبلی است. طرف مقابل باید اقدامات زیادی برای جلب اعتماد ما انجام دهد. ما چیزی جز کلمه «خوب» نشنیده‌ایم و مشخص است که این کافی نیست.\r\n\r\nعراقچی در پاسخ به سوالی مبنی بر اینکه «شما آماده هستید که به ترامپ شانسی بدهید که حداقل به آنچه می‌گوید گوش دهید»، گفت: بله، البته.\r\n\r\nاو در پاسخ به سوالی درباره اینکه «اگر او چیزهای درستی بگوید و با احترام به سمت شما بیاید، شما با ترامپ گفت‌وگو می‌کنید؟»، گفت: در این صورت، ما تصمیم می‌گیریم. من به شما نمی‌گویم که هر چیزی ۱۲ که او می‌گوید را رد می‌کنیم.\r\n\r\nاو در بخش دیگری از این گفت‌وگو در واکنش به ایده ترامپ برای غزه پساجنگ، مبنی بر انتقال مردم غزه به کشورهای دیگر به طور موقت و طولانی‌مدت به بهانه بازسازی این منطقه جنگ‌زده، با کنایه به چشم‌داشت ترامپ به خریداری جزیره گرینلند که تحت حاکمیت دانمارک قرار دارد و در شمالگان واقع شده، گفت: پیشنهاد من چیز دیگری است. به جای فلسطینی‌ها، اسرائیلی‌ها اخراج و به گرینلند فرستاده شوند تا با یک تیر دو نشان بزنند.\r\n\r\nوزیر امور خارجه ایران در ادامه این گفت‌وگو در پاسخ به سوالی درباره تأثیر درگیری‌ها با رژیم صهیونیستی بر گروه‌های مقاومت منطقه، از جمله حزب‌الله لبنان و حماس گفت: حماس و حزب‌الله آسیب دیده‌اند. اما در عین حال، در حال بازسازی خود هستند. چراکه همان طور که قبلاً گفته‌ام، این یک جنبش فکری، یک تفکر، یک هدف و آرمانی است که همواره وجود خواهد داشت.', 13, 'ادمین', '1738079263_img_1.jpg'),
(23, 'قلعه نویی: بزرگ‌تر از گواردیولا نیستیم', 'وی در ادامه به پرسش های مطرح در مورد تیم ملی فوتبال پاسخ داد و ابتدا در مورد لغو مینی کمپ تیم ملی گفت: با همه مربیان تماس گرفتیم اما مدت زمان تعطیلی نیم فصل کم بود و به همین دلیل آن را لغو کردیم. به هر حال خودمان‌ خیلی مواقع مربی باشگاهی بودیم و باید مشکلات و دغدغه‌های مربیان را در نظر داشته باشیم.\r\n\r\nسرمربی تیم ملی فوتبال در مور انتظاراتی که بازیکنان جوان برای حضور در اردوی این تیم دارند، با تاکید بر اینکه از گواردیولا بالاتر نیستیم، خاطرنشان کرد: او در بازی منچسترسیتی و چلسی از بازیکنان جدید استفاده کرد اما بعد گفت اشتباه کرده است. جوانگرایی در مملکت ما با مشکل مواجه است، در ژاپن یک بازیکن جوان پیش از ۱۸ سالگی، ۱۰۰ بازی بین‌المللی انجام داده است اما یکی از مشکلات و دغدغه‌های ما این است که جوانان و تیم‌های پایه ما دیدار بین‌المللی‌ شان کم دارند.\r\n\r\nقلعه‌نویی با تاکید بر اینکه به بازیکنان جوانان بها می دهیم اما باید در زمان مناسب به آنها فرصت بازی داده شود، ادامه داد: سید جلال حسینی را برای دیدار با ازبکستان در ترکیب تیم ملی گذاشتم و تا ۱۰ سال بعد از آن در ترکیب این تیم حضور داشت. امید ابراهیمی هم نخستین دیدار بین‌المللی اش را در ریاض مقابل الهلال انجام داد. در کل اینکه باید با مطالعه جوانگرایی داشته باشیم. با توجه به مشکلات موجود باید به گونه ای برنامه ریزی شود که با جوانگرایی هم صاحب نتیجه شویم و هم به تغییر نسل برسیم.\r\n\r\nسرمربی تیم ملی فوتبال همچنین در مورد بازیکنانی که تیم شان در مسابقات آسیایی حضور ندارد و به همین دلیل فرصتی برای دستیابی به تجربه بین المللی به دست نمی آورند، تاکید کرد: همه که درگیر مسابقات آسیایی نیستند. در کل چهار باشگاه ایران در لیگ نخبگان و لیگ قهرمانان حضور دارند. من مینی کمپ را با احترام به مربیان باشگاهی کنسل کردم. به هر حال بازیکنان باید حضور در میادین بین المللی را آغاز و به مرور وارد رده های بالاتر شوند. این موضوع به باشگاه‌ها ارتباطی ندارد بلکه مربوط به تیم های پایه می شود.\r\n\r\nقلعه نویی با تاکید بر دو موضوع گفت: ابتدا باید نتیجه بگیریم که من از نتایج تیم ملی خیلی خوشحالم. آقای گل لیگ برتر ایران در ۱۷ هفته فقط ۷ گل به ثمر رسانده است. یعنی میانگین گلزنی در لیگ ما خیلی پایین است. رتبه لیگ برتر ایران در جهان چندم است؟ کلاه خود را قاضی کنید. جوانگرایی در باشگاه‌ های ما کم است. البته به خاطر تحریم میزبانی نداریم اما این مسئله ارتباطی به فدراسیون ندارد.\r\n\r\nسرمربی تیم ملی فوتبال با بیان اینکه لیگ ایران در جهان صاحب رتبه ۶۷ است، تصریح کرد: در چنین شرایطی اما تیم ملی ایران رده ۱۸ دنیا را آنهم بعد از ۱۹ سال را به دست آورده است. این تیم در ۲۹ بازی نیز ۷۳ گل به ثمر رسانده است. آنهم در شرایطی که برای ۵ دیدار اخیر مدام روی هوا بودیم.\r\n\r\nوی با بیان اینکه من در این نتایج کمترین سهم را داشتم، گفت: مجموعه تیم ملی کار بزرگی انجام داده است. این نوید را هم می دهم که برنامه خیلی خوبی تدوین کرده ایم. ۲۷ اسفند گزارشی از عملکرد دو ساله خود ارائه خواهیم داد. این برنامه در تاریخ فوتبال ایران می‌ماند چون در گذشته این کار انجام نشده و در آینده نیز کسی آن را انجام‌ نمی‌دهد مگر اینکه از همین برنامه الگوبرداری کنند.\r\n\r\nقلعه نویی گفت: سه ماه از طریق صدا و سیما پیگیر بودیم تا بتوانیم در نیم فصل این گزارش را ارائه دهیم اما مخالفت هایی شد.قرار شد جمعه گذشته در برنمه شب های فوتبال این کار انجام شود اما به خاطر حواشی اخیر از آن منصرف شدیم. بنابراین ۲۷ اسفند در صورتیکه صدا و سیما به ما آنتن بدهد، این کار را انجام می دهیم.\r\n\r\nوی در واکنش به پرسش مطرح در مورد احتمال بازگشت احمد نوراللهی و اینکه در صورت عذرخواهی با تیم ملی باز می گردد و همچنین احتمال دعوت از دو رگه ها با تاکید بر اجرای عدالت، گفت: هر بازیکنی خوب باشد و طبق افکار تاکتیکی‌ ما بتواند به تیم ملی کمک کند، دعوت می شود. در مورد نوراللهی هم کسی این حرف را زده است؟من که خبر ندارم. روی عدالت تاکید دارم اما بحث نوراللهی یک موضوع دیگر است.', 14, 'ادمین', '1738079569_img_2.jpg'),
(24, 'چرا طلا و سکه گران شد؟', 'وی افزود: طی دو هفته گذشته قیمت طلای جهانی بالغ بر ۷۰ دلار افزایش یافته است. همچنین تحلیل گران حوزه طلا پیش بینی کرده اند که نرخ اونس طلا به ۳ هزار دلار نیز خواهد رسید. بنابراین بازار داخلی تحت تأثیر قرار گفته است.\r\n\r\nبدرافشان تصریح کرد: روند افزایش قیمت طلا از ابتدای سال جاری شروع شد که باعث شده شرایط صنعت طلا خوب پیش نرود زیرا این افزایش باعث افت تقاضا و به تبع آن کاهش تولید و فروش شده است.\r\n\r\nرئیس اتحادیه طلای تهران ادامه داد: بازار راکد است و رکود طی یکی دو ماه گذشته و به خصوص در روز مادر خود را کامل نشان داد. متأسفانه امسال، سال بحران برای صنعت طلا بود زیرا این افزایش‌ها باعث کاهش قدرت خرید مردم و رکود بازار شده است.\r\n\r\nوی تاکید کرد: مردم در صورتی که از درآمدشان، مبلغی باقی بماند طلا می‌خرند بنابراین افزایش نرخ طلا باعث شده تقاضا افت کند و واحدهای تولیدی در فشارهای اقتصادی قرار گیرند.\r\n\r\nبذرافشان گفت: در حال حاضر رکود چشمگیری بر بازار حاکم است و واحدهای تولیدی نسبت به پرداخت هزینه‌های جاری و پرسنلی دچار آسیب‌های مالی شدند و اگر این روند ادامه داشته باشند ممکن است به چرخه تولید و توزیع صدمات جدی وارد شود.', 15, 'ادمین', '1738231686_img_3.jpg'),
(26, 'دستگیری عامل قتل آتشین مرد جوان در پارک جنگلی چیتگر', 'وی افزود: به دنبال اعلام این خبر، تیمی زبده از کارآگاهان اداره دهم پلیس آگاهی تهران بزرگ راهی سردخانه بیمارستان شدند و جسد مرد جوانی را مشاهده کردند که براثر سوختگی به کام مرگ فرو رفته بود؛ بررسی‌های اولیه نیز نشان می‌داد متوفی قبل از اینکه روی تخت اورژانس فوت کند به امدادگران گفته بود که فردی به نام نیما او را با بنزین آتش زده است!\r\n\r\nاین مقام ارشد انتظامی تصریح کرد: بدین ترتیب پرونده وارد فاز جنایی شد و کارآگاهان در نخستین‌گام با اقدامات اطلاعاتی متوجه شدند که مقتول با نیما از گذشته اختلافات مالی داشتند که همین سرنخ مهم شک، تیم جنایی را بر انگیخت.\r\n\r\nسردار گودرزی متذکر شد: همکاران پرتلاشم در اداره دهم در گام بعدی با بهره‌گیری از شیوه‌های کشف نوین جرم دریافتند، مقتول و نیما که گاهی اوقات با هم موادمخدر نیز مصرف می‌کردند با یکدیگر در منطقه جنگلی چیتگر قرار ملاقات گذاشته بودند و روز حادثه بدن نیمه‌جان مقتول از همان‌جا به بیمارستان منتقل شده بود.\r\n\r\nاین مقام ارشد انتظامی تصریح کرد: کارآگاهان جنایی اداره دهم پس از کشف این سرنخ مهم، بی‌درنگ راهی مخفیگاه نیما شدند و پس از تعقیب و مراقبت‌های نامحسوس متهم را در یک عملیات غافلگیرانه دستگیر کردند.\r\n\r\nرئیس پلیس آگاهی پایتخت متذکر شد: پس از عملیات دستگیری، کارآگاهان جنایی مأموریت یافتند تا با تجزیه و تحلیل‌های اطلاعاتی، تحقیقات خود را در رابطه با این پرونده ادامه دهند.\r\nوی خاطرنشان کرد: با صدور قرار قانونی از سوی مرجع قضائی، متهم جهت روشن شدن زوایای پنهان پرونده در اختیار اداره دهم پلیس آگاهی تهران بزرگ قرار گرفت و تحقیقات همچنان ادامه دارد.', 3, 'ادمین', '1738247331_img_4.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `posts_slider`
--

CREATE TABLE `posts_slider` (
  `id` int(11) NOT NULL,
  `post_id` int(11) NOT NULL,
  `active` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `posts_slider`
--

INSERT INTO `posts_slider` (`id`, `post_id`, `active`) VALUES
(4, 22, 0),
(5, 23, 1),
(6, 24, 0);

-- --------------------------------------------------------

--
-- Table structure for table `subscribers`
--

CREATE TABLE `subscribers` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `subscribers`
--

INSERT INTO `subscribers` (`id`, `name`, `email`) VALUES
(1, 'سارا', 'sara@gmail.com'),
(2, 'نیما', 'nima@gmail.com'),
(3, 'علی', 'ali@gmail.com');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('user','admin') DEFAULT 'user'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `role`) VALUES
(1, 'admin', 'admin@gmail.com', '123456789', 'admin'),
(2, 'nima', 'nima@gmail.com', '123456', 'user'),
(3, 'Omid', 'omid@gmail.com', '282828', 'user'),
(4, 'Sara', 'Sara@gmail.com', '123456', 'user');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`);

--
-- Indexes for table `posts_slider`
--
ALTER TABLE `posts_slider`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`);

--
-- Indexes for table `subscribers`
--
ALTER TABLE `subscribers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `posts_slider`
--
ALTER TABLE `posts_slider`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `subscribers`
--
ALTER TABLE `subscribers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `posts_slider`
--
ALTER TABLE `posts_slider`
  ADD CONSTRAINT `posts_slider_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
